trade_exp/src/Documents/ПриобретениеУслугПрочихАктивов/ПриобретениеУслугПрочихАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПриобретениеУслугПрочихАктивов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗакупкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПодразделениеОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЭтоЗатратыПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УПДАктОтПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>_Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2373e4ed-7dfa-4702-afa9-7a49ffe93157">
    <name>ДатаАктаОтПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="285fc519-6042-40bc-bfb2-341e823756eb">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cf93793d-bd1a-4abd-be34-2aa0c671ef23">
    <name>Автомобиль</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9a0e2a0c-4f47-493e-8984-be9ff25bc79f">
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8b83e65e-41fc-4f1f-8f2e-f33f07070d11">
    <name>ПрибытиеНаОтгрузку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d00b8315-1114-493a-b5bd-6c10509dae59">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КомментарийРаспределения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОснованиеЗатрат</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b14e1790-ac00-460e-9656-31b62e963ccb">
      <name>СтатьяРасходовБУ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2a74cd19-a14f-4c73-a83e-9cc5a3651298">
      <name>СкладОснованияЗатрат</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="961aa91f-f258-47f3-b868-9673a4117b30">
      <name>Рейсы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c3900451-0683-4a94-9b3a-a1e23ac7028e">
      <name>ЗаказНаДоставку</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3ff6a3eb-0fa6-496a-951a-ed075c58d8bd">
      <name>ОбъектРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e3ee02ad-1208-4c1c-8b3d-5545d6658f2e">
      <name>АналитикаОбъекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/ПриобретениеУслугПрочихАктивов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область Печать 
&После("ДобавитьКомандыПечати")
Процедура Док_ДобавитьКомандыПечати(КомандыПечати)	
	//		
КонецПроцедуры

&После("Печать")
Процедура Док_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	//		
КонецПроцедуры
#КонецОбласти

Функция ОпределениеРеализацииПоЗаказу(Заказ) 
	Запрос = Новый запрос; 
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗаказКлиента КАК ДокЗаказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ДокЗаказ.Ссылка = РеализацияТоваровУслуг.ЗаказКлиента
	               |ГДЕ
	               |	ДокЗаказ.Ссылка = &Заказ";
	Запрос.УстановитьПараметр("Заказ", Заказ); 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка; 
	Иначе
		Возврат Неопределено; 
	КонецЕслИ; 
КонецФункции

Функция ПолучитьДокументыПродажи(мРейсов, Организация = Неопределено) Экспорт
	
	Организация1СК = Справочники.Организации.НайтиПоНаименованию("1СК ООО", Истина);
	
	АвтоуслугиПоДоставкеТовараНаФилиалы = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("0А-000257");
	ДоставкаТовараПокупателямЧерез1СК   = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("0А-000667");
	ДоставкаТовараПокупателям           = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("0А-000256");
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаПеревозкуРейсРасчетДоставки.ДокументПродажи КАК ДокПродажи,
		|	ВЫБОР
		|		КОГДА ЗаданиеНаПеревозкуРейсРасчетДоставки.ДокументПродажи ССЫЛКА Документ.ОбращениеКлиента
		|			ТОГДА ЗаданиеНаПеревозкуРейсРасчетДоставки.ДокументПродажи
		|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ОбращениеКлиента.ПустаяСсылка)
		|	КОНЕЦ КАК ОбращениеКлиента,
		|	ЗаданиеНаПеревозкуРейсРасчетДоставки.ОплатаВодителю КАК ОплатаВодителю,
		|	ЗаданиеНаПеревозкуРейсРасчетДоставки.Ссылка КАК Рейс,
		|	ЗаданиеНаПеревозкуРейсРасчетДоставки.Ссылка.Подразделение КАК Подразделение,
		|	ЗаданиеНаПеревозкуРейсРасчетДоставки.Ссылка.ПеревозчикПартнер КАК ПеревозчикПартнер,
		|	ЗаданиеНаПеревозкуРейсРасчетДоставки.Ссылка.Перевозчик КАК Перевозчик,
		|	ЗаданиеНаПеревозкуРейсРасчетДоставки.Ссылка.СтавкаНДСПеревозчика КАК СтавкаНДС,
		|	ЗаданиеНаПеревозкуРейсРасчетДоставки.ЗаказНаДоставку КАК ЗаказНаДоставку,
		|	ЗаданиеНаПеревозкуРейсРасчетДоставки.ЗаказНаДоставку.Партнер КАК АналитикаРасходовПеремещения,
		|	ЗаданиеНаПеревозкуРейсРасчетДоставки.ЗаказНаДоставку.АдресДоставки КАК АдресДоставки,
		|	ВЫБОР
		|		КОГДА ЗаданиеНаПеревозкуРейсРасчетДоставки.ЗаказНаДоставку.СтоимостьДоставки > 0
		|			ТОГДА &Организация1СК
		|		ИНАЧЕ ЗаданиеНаПеревозкуРейсРасчетДоставки.ЗаказНаДоставку.Организация
		|	КОНЕЦ КАК Организация
		|ПОМЕСТИТЬ ВТИтог
		|ИЗ
		|	Документ.ЗаданиеНаПеревозкуРейс.РасчетДоставки КАК ЗаданиеНаПеревозкуРейсРасчетДоставки
		|ГДЕ
		|	ЗаданиеНаПеревозкуРейсРасчетДоставки.Ссылка.Проведен
		|	И ЗаданиеНаПеревозкуРейсРасчетДоставки.Ссылка В(&мРейсов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.ДокПродажи КАК ДокПродажи, 
		|	МАКСИМУМ(Итог.ОбращениеКлиента) КАК ОбращениеКлиента,
		|	Итог.Рейс КАК Рейс,
		|	Итог.Подразделение КАК Подразделение,
		|	Итог.ПеревозчикПартнер КАК ПеревозчикПартнер,
		|	Итог.Перевозчик КАК Перевозчик,
		|	Итог.СтавкаНДС КАК СтавкаНДС,
		|	Итог.ЗаказНаДоставку КАК ЗаказНаДоставку,
		|	СУММА(Итог.ОплатаВодителю) КАК ОплатаВодителю,
		|	Итог.АналитикаРасходовПеремещения КАК АналитикаРасходовПеремещения,
		|	Итог.АдресДоставки КАК АдресДоставки,
		|	Итог.Организация КАК Организация
		|ИЗ
		|	ВТИтог КАК Итог
		|ГДЕ
		|	Итог.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	Итог.ДокПродажи,
		|	Итог.Рейс,
		|	Итог.Подразделение,
		|	Итог.ПеревозчикПартнер,
		|	Итог.Перевозчик,
		|	Итог.СтавкаНДС,
		|	Итог.ЗаказНаДоставку,
		|	Итог.АналитикаРасходовПеремещения,
		|	Итог.АдресДоставки,
		|	Итог.Организация
		|ИТОГИ              
		|	МАКСИМУМ(ОбращениеКлиента),
		|	СУММА(ОплатаВодителю)
		|ПО
		|	Организация,
		|	ПеревозчикПартнер,
		|	Рейс,
		|	ЗаказНаДоставку";
	                               
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Итог.Организация = &Организация", "Истина");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("мРейсов", мРейсов);
	Запрос.УстановитьПараметр("Организация1СК", Организация1СК);
	
	МассивИтоговыхЗаписей = Новый Массив;
	
	ИтоговыеЗаписиОрганизация = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ИтоговыеЗаписиОрганизация.Следующий() Цикл	
		ЭтоОрганизация1СК = ИтоговыеЗаписиОрганизация.Организация = Организация1СК;

		ИтоговыеЗаписиПеревозчикПартнер = ИтоговыеЗаписиОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		Пока ИтоговыеЗаписиПеревозчикПартнер.Следующий() Цикл		
			
			ИтоговыеЗаписиРейсы = ИтоговыеЗаписиПеревозчикПартнер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Таб = Новый ТаблицаЗначений;  
			Таб.Колонки.Добавить("Организация");
		    Таб.Колонки.Добавить("Подразделение");
		    Таб.Колонки.Добавить("ПеревозчикПартнер");
			Таб.Колонки.Добавить("Перевозчик");
			Таб.Колонки.Добавить("ЗаказНаДоставку");
		    Таб.Колонки.Добавить("СтавкаНДС");
			Таб.Колонки.Добавить("СуммаНДС");
		    Таб.Колонки.Добавить("ОснованиеЗатрат");
			Таб.Колонки.Добавить("Рейсы");
			Таб.Колонки.Добавить("Содержание");
			Таб.Колонки.Добавить("Количество");	
			Таб.Колонки.Добавить("Цена");
			Таб.Колонки.Добавить("Сумма");
			Таб.Колонки.Добавить("СуммаСНДС");		
			Таб.Колонки.Добавить("СтатьяРасходов");
			Таб.Колонки.Добавить("СтатьяРасходовБУ");
			Таб.Колонки.Добавить("АналитикаРасходов");
			Таб.Колонки.Добавить("СкладОснованияЗатрат");
							
			Пока ИтоговыеЗаписиРейсы.Следующий() Цикл
				
				ИтоговыеЗаписиЗаказНаДоставку = ИтоговыеЗаписиРейсы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);			
				Пока ИтоговыеЗаписиЗаказНаДоставку.Следующий() Цикл
					
					ДетальныеЗаписи = ИтоговыеЗаписиЗаказНаДоставку.Выбрать();
					КоличествоДетальныхЗаписей = ДетальныеЗаписи.Количество();
					
					Стр = Неопределено;
					Рейс = ИтоговыеЗаписиЗаказНаДоставку.Рейс;                                  
					                      
					СтруктураРезультат = Документы.ЗаданиеНаПеревозкуРейс.РасчетОплатыВодителю(Рейс, ИтоговыеЗаписиЗаказНаДоставку.ЗаказНаДоставку);
					Если СтруктураРезультат = Неопределено Тогда
						ОбщегоНазначения.СообщитьПользователю(
							"По Рейсу: '" + Рейс + 
							"', по заказу '" + ИтоговыеЗаписиЗаказНаДоставку.ЗаказНаДоставку + 
							"' происходит ошибка при расчете оплаты водителю!", Рейс);	
					Иначе
						ОплатаВодителю = Окр(СтруктураРезультат.ОплатаВодителю / КоличествоДетальныхЗаписей, 2);   
						ОплатаВодителюДельта = СтруктураРезультат.ОплатаВодителю - (ОплатаВодителю * КоличествоДетальныхЗаписей);
						
						СуммаДляКритериев = Цел(ОплатаВодителю);
						ОстатокОтДелНа10 = СуммаДляКритериев%10; 
						
						Если ОстатокОтДелНа10 >= 3 И ОстатокОтДелНа10 < 8 тогда
							НоваяОплата = Цел(СуммаДляКритериев/10)*10+5;
						ИначеЕсли ОстатокОтДелНа10 <3 Тогда
							НоваяОплата = Цел(СуммаДляКритериев/10)*10;
						ИначеЕсли ОстатокОтДелНа10 >= 8 Тогда
							НоваяОплата = Цел(СуммаДляКритериев/10)*10+10;
						КонецЕсли;
						
						
						СуммаНДС = Окр(СтруктураРезультат.СуммаНДС / КоличествоДетальныхЗаписей, 2);
						СуммаНДСДельта = СтруктураРезультат.СуммаНДС - (СуммаНДС * КоличествоДетальныхЗаписей);
						
						Пока ДетальныеЗаписи.Следующий() Цикл
							Стр = Таб.Добавить();       
							Стр.Организация = ДетальныеЗаписи.Организация;
						    Стр.Подразделение = ДетальныеЗаписи.Подразделение;
						    Стр.ПеревозчикПартнер = ДетальныеЗаписи.ПеревозчикПартнер;
							Стр.Перевозчик = ДетальныеЗаписи.Перевозчик;
							Стр.ЗаказНаДоставку = ДетальныеЗаписи.ЗаказНаДоставку;
							ПеремСтавкаНДС = ДетальныеЗаписи.СтавкаНДС;
							Если ТипЗнч(ПеремСтавкаНДС) = Тип("ПеречислениеСсылка.СтавкиНДС") Тогда 
								Стр.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС", ПеремСтавкаНДС); 
							Иначе
								Стр.СтавкаНДС = ПеремСтавкаНДС; 
							КонецЕсли; 
							Стр.СуммаНДС = СуммаНДС;
							Стр.Цена = НоваяОплата;//ОплатаВодителю;
							Стр.Сумма = НоваяОплата;//ОплатаВодителю;
							Стр.СуммаСНДС = НоваяОплата;//ОплатаВодителю;  
							Если ТипЗнч(ДетальныеЗаписи.ДокПродажи) = Тип("ДокументСсылка.ЗаказКлиента") Тогда 
								Стр.ОснованиеЗатрат = ОпределениеРеализацииПоЗаказу(ДетальныеЗаписи.ДокПродажи)	
							Иначе
								Стр.ОснованиеЗатрат = ДетальныеЗаписи.ДокПродажи;
							КонецЕсли; 
							Стр.Рейсы = Рейс;
							Стр.Содержание = "Доставка груза " + ДетальныеЗаписи.АдресДоставки;
							Стр.Количество = 1;
							
							Если ТипЗнч(ДетальныеЗаписи.ДокПродажи) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
								Если ЗначениеЗаполнено(ИтоговыеЗаписиЗаказНаДоставку.ОбращениеКлиента) Тогда
									Стр.АналитикаРасходов = ДетальныеЗаписи.Подразделение;
								Иначе
									Стр.АналитикаРасходов = ДетальныеЗаписи.АналитикаРасходовПеремещения;
								КонецЕсли;
								
								Стр.СтатьяРасходов = АвтоуслугиПоДоставкеТовараНаФилиалы;
								Стр.СтатьяРасходовБУ = АвтоуслугиПоДоставкеТовараНаФилиалы;
								Стр.СкладОснованияЗатрат = ДетальныеЗаписи.ДокПродажи.СкладПолучатель;
							ИначеЕсли ТипЗнч(ДетальныеЗаписи.ДокПродажи) = Тип("ДокументСсылка.ОбращениеКлиента") И 
								ТипЗнч(ДетальныеЗаписи.ДокПродажи.ИсточникЗаполненияТоваровДляДовоза) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
								
								Стр.СтатьяРасходов = АвтоуслугиПоДоставкеТовараНаФилиалы;
								Стр.СтатьяРасходовБУ = АвтоуслугиПоДоставкеТовараНаФилиалы;
								Стр.АналитикаРасходов = ДетальныеЗаписи.АналитикаРасходовПеремещения;
								Стр.СкладОснованияЗатрат = ДетальныеЗаписи.ДокПродажи.ИсточникЗаполненияТоваровДляДовоза.СкладПолучатель;
							Иначе
								Если ЭтоОрганизация1СК Тогда  
									Стр.СтатьяРасходов = ДоставкаТовараПокупателямЧерез1СК;
									Стр.СтатьяРасходовБУ = ДоставкаТовараПокупателямЧерез1СК;
								Иначе
									Стр.СтатьяРасходов = ДоставкаТовараПокупателям;
									Стр.СтатьяРасходовБУ = ДоставкаТовараПокупателям;
								КонецЕсли;
								
								Стр.АналитикаРасходов = ДетальныеЗаписи.Подразделение;
								Если ТипЗнч(ДетальныеЗаписи.ДокПродажи) = Тип("ДокументСсылка.ОбращениеКлиента") Тогда
									Стр.СкладОснованияЗатрат = Документы.ОбращениеКлиента.ПолучитьСклад(ДетальныеЗаписи.ДокПродажи);
								Иначе
									Стр.СкладОснованияЗатрат = ДетальныеЗаписи.ДокПродажи.Склад;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
						
						Если ЗначениеЗаполнено(Стр) Тогда
							Стр.Цена = Стр.Цена; // + ОплатаВодителюДельта;
							Стр.Сумма = Стр.Сумма; // + ОплатаВодителюДельта;
							Стр.СуммаСНДС = Стр.СуммаСНДС; // + ОплатаВодителюДельта;
							Стр.СуммаНДС = Стр.СуммаНДС + СуммаНДСДельта;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			Если ЗначениеЗаполнено(Таб) Тогда
				МассивИтоговыхЗаписей.Добавить(ПоместитьВоВременноеХранилище(Таб, Новый УникальныйИдентификатор));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивИтоговыхЗаписей;
КонецФункции

&После("ЗарегистрироватьУчетныеМеханизмы")
Процедура Док_ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента)
	МеханизмыДокумента.Добавить("РасходыПоОбъектам");
КонецПроцедуры

&ИзменениеИКонтроль("ДанныеДокументаДляПроведения")
Функция Док_ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.ПриобретениеУслугПрочихАктивов") Тогда
		ДокументСсылка = Документ.Ссылка;
		ДокументОбъект = Документ;
	Иначе
		ДокументСсылка = Документ;
		ДокументОбъект = Документ.ПолучитьОбъект();
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если ДопПараметры <> Неопределено
		И ДопПараметры.Свойство("МенеджерВременныхТаблиц")
		И ДопПараметры.МенеджерВременныхТаблиц <> Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = ДопПараметры.МенеджерВременныхТаблиц;
	Иначе
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	ПолучитьДанныеДокумента(Запрос, ДокументСсылка);
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		СформироватьСуммыДокументаВВалютахУчета(Запрос, ТекстыЗапроса, Регистры);
		
		ТекстЗапросаТаблицаПрочиеРасходы(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаПартииПрочихРасходов(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаПрочиеДоходы(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаДвиженияКонтрагентДоходыРасходы(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаДенежныеСредстваУПодотчетныхЛиц(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаДвиженияДенежныеСредстваКонтрагент(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаДвиженияПоПрочимАктивамПассивам(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаПрочиеАктивыПассивы(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаРеестрДокументов(ТекстыЗапроса, Регистры, ДокументОбъект);
		#Вставка 
		ТекстЗапросаТаблицаРасходыПоОбъекты(Запрос, ТекстыЗапроса, Регистры);
		#КонецВставки
		
		ОтразитьВУчетеНДС(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		
		ПриобретениеУслугПрочихАктивовЛокализация.ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
	КонецЕсли;
	
	ДобавитьТекстыОтраженияВзаиморасчетов(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	

КонецФункции   

Функция ТекстЗапросаТаблицаРасходыПоОбъекты(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "РасходыПоОбъектам";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("втРасходы", ТекстыЗапроса) Тогда
		Документы.ПриобретениеУслугПрочихАктивов.ТекстЗапросаТаблицаВтРасходы(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	&Период КАК Период,
	               |	&Организация КАК Организация,
	               |	&Подразделение КАК Подразделение,
	               |	ТаблицаТовары.АналитикаРасходов КАК АналитикаРасходов,
	               |	ТаблицаТовары.СтатьяРасходов КАК СтатьяРасходов,
	               |	ТаблицаТовары.ОбъектРасходов КАК ОбъектРасходов,
	               |	ТаблицаТовары.АналитикаОбъекта КАК АналитикаОбъекта,
	               |	МИНИМУМ(ТаблицаТовары.НомерСтроки) КАК НомерСтроки,
	               |	СУММА(ТаблицаТовары.СуммаСНДС) КАК Сумма
	               |ИЗ
	               |	Документ.ПриобретениеУслугПрочихАктивов.Расходы КАК ТаблицаТовары
	               |ГДЕ
	               |	ТаблицаТовары.Ссылка = &Ссылка
	               |	И НЕ ТаблицаТовары.ОбъектРасходов = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |	И НЕ ТаблицаТовары.АналитикаОбъекта = ЗНАЧЕНИЕ(Справочник.АналитикаОбъекта.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаТовары.АналитикаРасходов,
	               |	ТаблицаТовары.СтатьяРасходов,
	               |	ТаблицаТовары.ОбъектРасходов,
	               |	ТаблицаТовары.АналитикаОбъекта";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

	
КонецФункции

#КонецЕсли
